Ran Plan for dir: `spanner-instance` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/Onkar179/terraform-sample-repo/5/default/spanner-instance/default.tfplan\"" in "/atlantis-data/repos/Onkar179/terraform-sample-repo/5/default/spanner-instance": exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.cloud_spanner["test-instance"].google_spanner_instance.instance_processing_units[0] will be created
  + resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner demo"
      + effective_labels = {
          + "env" = "demo"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "demo"
        }
      + name             = "test-instance"
      + num_nodes        = (known after apply)
      + processing_units = 100
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "demo"
        }
    }

  # module.cloud_spanner["test-instance"].google_spanner_instance_iam_member.instance["user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin"] will be created
  + resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance"
      + member   = "user:onkar.naik@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance.instance_processing_units[0] will be created
  + resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner prod"
      + effective_labels = {
          + "env" = "prod"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "prod"
        }
      + name             = "test-instance-2"
      + num_nodes        = (known after apply)
      + processing_units = 200
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "prod"
        }
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance_iam_member.instance["user:dibanyshu.rai@forescout.com=>roles/spanner.databaseAdmin"] will be created
  + resource "google_spanner_instance_iam_member" "instance" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + instance = "test-instance-2"
      + member   = "user:dibanyshu.rai@forescout.com"
      + project  = "onkar-17-cloud"
      + role     = "roles/spanner.databaseAdmin"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + spanner_instance_details = {
      + test-instance   = {
          + spanner_instance_iam_details = {
              + "user:onkar.naik@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance"
                  + member    = "user:onkar.naik@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
      + test-instance-2 = {
          + spanner_instance_iam_details = {
              + "user:dibanyshu.rai@forescout.com=>roles/spanner.databaseAdmin" = {
                  + condition = []
                  + etag      = (known after apply)
                  + id        = (known after apply)
                  + instance  = "test-instance-2"
                  + member    = "user:dibanyshu.rai@forescout.com"
                  + project   = "onkar-17-cloud"
                  + role      = "roles/spanner.databaseAdmin"
                }
            }
          + spanner_instance_id          = (known after apply)
        }
    }
╷
│ Error: Failed to retrieve project, pid: , err: project: required field is not set
│ 
│   with google_compute_network.vpc_network,
│   on main.tf line 20, in resource "google_compute_network" "vpc_network":
│   20: resource "google_compute_network" "vpc_network" {
│ 
╵
╷
│ Error: Failed to retrieve project, pid: , err: project: required field is not set
│ Failed to retrieve zone, pid: , err: zone: required field is not set
│ 
│   with google_compute_instance.vm_instance,
│   on main.tf line 37, in resource "google_compute_instance" "vm_instance":
│   37: resource "google_compute_instance" "vm_instance" {
│ 
╵

```
</details>